#include <iostream>
using namespace std;
int main()
{
	int a;
	cout << "Введите число" << endl;
	cin >> a;
	if (a / 10 == 0) {
		cout << "однозначное ";
	}
	if ((a / 10 != 0) && (a / 100 == 0)) {
		cout << "двузначное ";
	}
	if ((a / 100 != 0) && (a / 1000 == 0)) {
		cout << "трёхзначное ";
	}
	if ((a / 1000 != 0) && (a / 10000 == 0)) {
		cout << "четырёхзначное ";
	}
	if ((a / 10000 != 0) && (a / 100000 == 0)) {
		cout << "пятизначное ";
	}
	if ((a / 100000 != 0) && (a / 1000000 == 0)) {
		cout << "шестизначное ";
	}
	if ((a / 1000000 != 0) && (a / 10000000 == 0)) {
		cout << "семизначное ";
	}
	if ((a / 10000000 != 0) && (a / 100000000 == 0)) {
		cout << "восьмизначное ";
	}
	if (a == 0) {
		cout << "нулевое число";
	}
	if ((a % 2 == 0) && (a != 0)) {
		cout << "чётное число";
	}
	if (a % 2 != 0) {
		cout << "нечётное число";
	}
	
}
