#include <iostream>
using namespace std;
int main()
{
    int N;
    char C;
    cout << "Введите направление робота" << endl;
    cin >> C;
    cout << "Введите команду роботу" << endl;
    cin >> N;
    if ((N != 1) && (N != 0) && (N != (-1))) {
        cout << "Введены некорректные данные";
    }
    else {
        if ((C == 'С') && (N == 0)) {
            cout << "Направление робота на север";
        }
        else if ((C == 'В') && (N == 0)) {
            cout << "Направление робота на восток";
        }
        else if ((C == 'З') && (N == 0)) {
            cout << "Направление робота на запад";
        }
        else if ((C == 'Ю') && (N == 0)) {
            cout << "Направление робота на юг";
        }
        else if ((C == 'В') && (N == 1)) {
            cout << "Направление робота на юг";
        }
        else if ((C == 'В') && (N == -1)) {
            cout << "Направление робота на север";
        }
        else if ((C == 'З') && (N == 1)) {
            cout << "Направление робота на север";
        }
        else if ((C == 'З') && (N == -1)) {
            cout << "Направление робота на юг";
        }
        else if ((C == 'С') && (N == 1)) {
            cout << "Направление робота на восток";
        }
        else if ((C == 'С') && (N == -1)) {
            cout << "Направление робота на запад";
        }
        else if ((C == 'Ю') && (N == 1)) {
            cout << "Направление робота на запад";
        }
        else if ((C == 'Ю') && (N == -1)) {
            cout << "Направление робота на восток";
        }
    }
}


